
&НаКлиенте
Процедура ПреобразоватьВремя(Команда)
	
	РезультатПреобразования2 = СтрЗаменить(Строка_UTC,"T"," ");
	РезультатПреобразования3 = СтрЗаменить(РезультатПреобразования2,"Z","");
	//РезультатПреобразования4 = СтрЗаменить(РезультатПреобразования3,".","");
	//РезультатПреобразования5 = СтрЗаменить(РезультатПреобразования4,":","");
		
	РезультатПреобразования = Строка(Дата(РезультатПреобразования3));
	
	//	Строка(МестноеВремя(Строка_UTC,GMT+3));  06.01.2019T08:00:00Z
	//	Сообщить(Дата(1,1,1)+(ТекущаяДата()-НачалоДня(ТекущаяДата())));	
	
КонецПроцедуры                                                      
