//  git checkout master
//  git
//
//	branch  "name_branch" Создать Ветку 
//	branch просмотр всех веток 
//
//	checkout feature/NAJ-33 переключится на ветку NAJ-33
//	checkout отображение текущей ветки
//
//	status отображение статуса изменений
//	add . добавлени фалов всех изменеенных 
//
//	git add "/home/andrew/1c/1CGit/1C_NAJET/src/cf/Documents/ПродажаРейсовПоВС/Forms/ФормаДокумента/Ext/Form/Module.bsl"
//	git add  "/home/andrew/1c/1CGit/1C_NAJET/src/cf/Documents/ПродажаРейсовПоВС/*" "/home/andrew/1c/1CGit/1C_NAJET/src/cf/Documents/ПродажаРейсовПоВС.xml"
//	git add  "/home/andrew/1c/1CGit/1C_NAJET/src/cf/CommonModules/ВебСервисы/Ext/Module.bsl"
//	
//	git add  "/home/andrew/1c/1CGit/1C_NAJET/src/cf/CommonModules/СобытияВС/Ext/Module.bsl"
//	
//	git add "/home/andrew/1c/1CGit/1C_NAJET/src/cf/CommonForms/ИнтеграцияСВебПриложением/Ext/Form.xml" "/home/andrew/1c/1CGit/1C_NAJET/src/cf/CommonForms/ИнтеграцияСВебПриложением/Ext/Form/Module.bsl"
//	изменено:      cf/CommonForms/ИнтеграцияСВебПриложением/Ext/Form.xml
//	изменено:      cf/CommonForms/ИнтеграцияСВебПриложением/Ext/Form/Module.bsl
//
//	checkout file1 file2 folder1 folder2 отмена предыдущего добавления после add	
//		Изменения, которые не в индексе для коммита:
//  		(используйте «git add/rm <файл>…», чтобы добавить или удалить файл из индекса)
//  		(используйте «git checkout -- <файл>…», чтобы отменить изменения в рабочем каталоге)
//
//  Изменения, которые будут включены в коммит:
//  (используйте «git reset HEAD <файл>…», чтобы убрать из индекса)
//
//	commit -m "Описание или комментарий по добавляемому исходнику"
//	reset HEAD~1 отмена удаление последнего коммита 
//	commit --amend редактировать коммит в текстовом редакторе
//	commit --amend --noedit без измененеия коммита 
//	
//	log просмотр изменений 
//
//	push orign  
//	push -f перезатирает предыдущие коммиты и исхолдники 
//
//  git add  "/home/andrew/1c/1CGit/1C_NAJET/src/cf/ВнешниеОбработки/ПолучениеДанныхИзExcel/*"
//
//  спецификатор пути не соответствует ни одному файлу
//
//  git add  "/home/andrew/1c/1CGit/1C_NAJET/src/cf/Catalogs/ВС/Forms/ФормаВыбора/Ext/Form/Module.bsl" "/home/andrew/1c/1CGit/1C_NAJET/src/cf/Catalogs/ВС/Forms/ФормаСписка/Ext/Form/Module.bsl"
//
//  Обновление струтуры файлов из мастера вместо git pull
//    выполнять в ветке: git rebase origin/master
//	   если ветка уже была запушена, то после ребейза нужно будет делать git push -f
//
//	NAJ-62 Исправление сохранения данных по времени опаздывающего пассажира и пред и после полетной подготовки
//	


//
//
//
&НаКлиенте
Процедура GITCommit(Команда)
	
	Если Not ValueIsFilled(НомерВетки) Тогда 
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПредупреждениеПриОшибке",ЭтотОбъект),"Номер задачи не указан!",0,"Внимание!");
		Возврат;
	ИначеЕсли ValueIsFilled(КомментарийККомиту) Тогда 
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПредупреждениеПриОшибке",ЭтотОбъект),"Комментарий к коммиту не указан!",0,"Внимание!");
		Возврат;		
	КонецЕсли;
	
	КомандаСистемы("git commit -m " + Символ(34) + "NAJ-"+ Строка(НомерВетки) + " " + КомментарийККомиту + "." + Символ(34))
	
КонецПроцедуры

&AtClient
Процедура ПредупреждениеПриОшибке(Параметры) Экспорт 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереключениеНаВеткуmasterНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеНаВеткуmaster(Команда)
	ПереключениеНаВеткуmasterНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереключениеНаЗадачуНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеНаЗадачу(Команда)
	ПереключениеНаЗадачуНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереключениеНаОшибкуНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключениеНаОшибку(Команда)
	ПереключениеНаОшибкуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура GITFetch(Команда)
	КомандаСистемы("git fetch --all")
КонецПроцедуры

&НаКлиенте
Процедура GITPull(Команда)
	// сделать проверку на то что 
	// в данный момент ветка установлена в "мастер" 
	КомандаСистемы("git pull")
КонецПроцедуры

&НаКлиенте
Процедура GITAdd(Команда)
	//КомандаСистемы("top")
КонецПроцедуры

&НаСервереБезКонтекста
Процедура GITRebaseНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура GITRebase(Команда)
	GITRebaseНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтменитьПоследнийКомитНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоследнийКомит(Команда)
	ОтменитьПоследнийКомитНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура GITStatus(Команда)
	КомандаСистемы("git status")
КонецПроцедуры

&НаСервереБезКонтекста
Процедура GITbranchНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура GITbranch(Команда)
	GITbranchНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура GITCheckout(Команда)
	
	Если Not ValueIsFilled(НомерВетки) Тогда 
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПредупреждениеПриОшибке",ЭтотОбъект),"Номер задачи не указан!",0,"Внимание!");
		Возврат;
	КонецЕсли;
	
	Если Not ValueIsFilled(ПризнакПараметра) Тогда 
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПредупреждениеПриОшибке",ЭтотОбъект),"Не указан признак параметра!",0,"Внимание!");
		Возврат;
	КонецЕсли;
	
	Если ПринудительноForce Тогда 
		КомандаСистемы("git checkout -f " + ПризнакПараметра + "/" + "NAJ-" + НомерВетки + " &") // --force feature/NAJ-132
	Иначе 
		ЗапуститьПриложение("git checkout " + ПризнакПараметра + "/" + "NAJ-" + НомерВетки + " &") // --force
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура GITStash(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// открыть форму в отдельном не зависимом окне не мешая работе другим окнам 
	//РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс
	 //РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	 //РежимОткрытияОкна Независимый 
КонецПроцедуры

&НаКлиенте
Процедура ПризнакПараметраПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ПризнакПараметра) Тогда
		//Если ПризнакПараметра = "" Тогда 
		//	//ЭтаФорма.Элементы.ПризнакПараметра.ЦветТекста .Синий .Красный .Зеленый .Вид
		//ИначеЕсли ПризнакПараметра = "" Тогда
		//	//ЭтаФорма.Элементы.ПризнакПараметра.ЦветТекста .Синий .Красный .Зеленый .Вид
		//КонецЕсли;
	КонецЕсли;
КонецПроцедуры

