
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Для Андроида
	Для каждого ТекущаяКартинка Из Параметры.AndroidИконки Цикл
		Строка = ИконкиAndroid.Добавить();
		Строка.Идентификатор = ТекущаяКартинка.Имя;
		Строка.Представление = ТекущаяКартинка.Представление;
		Строка.Значение = ТекущаяКартинка.Значение;
	КонецЦикла;
	Для каждого ТекущаяКартинка Из Параметры.AndroidЛоготипы Цикл
		Строка = ЛоготипыAndroid.Добавить();
		Строка.Идентификатор = ТекущаяКартинка.Имя;
		Строка.Представление = ТекущаяКартинка.Представление;
		Строка.Значение = ТекущаяКартинка.Значение;
	КонецЦикла;
	// Для ИОС
	Для каждого ТекущаяКартинка Из Параметры.iOSИконки Цикл
		Строка = ИконкиiOS.Добавить();
		Строка.Идентификатор = ТекущаяКартинка.Имя;
		Строка.Представление = ТекущаяКартинка.Представление;
		Строка.Значение = ТекущаяКартинка.Значение;
	КонецЦикла;
	Для каждого ТекущаяКартинка Из Параметры.iOSЛоготипы Цикл
		Строка = ЛоготипыiOS.Добавить();
		Строка.Идентификатор = ТекущаяКартинка.Имя;
		Строка.Представление = ТекущаяКартинка.Представление;
		Строка.Значение = ТекущаяКартинка.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайла(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Элемент.Родитель.ТекущиеДанные;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл картинки: ';en='Select picture file: '", "ru") + Элемент.Заголовок;
	ДиалогОткрытияФайла.Фильтр = НСтр("ru='Картинки';en='Pictures'", "ru") + " (*.png)|*.png";
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина;
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Элемент.Родитель.ТекущиеДанные.Значение = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	
	Таблицы = Новый Массив;
	Таблицы.Добавить("ИконкиAndroid");
	Таблицы.Добавить("ИконкиiOS");
	Таблицы.Добавить("ЛоготипыAndroid");
	Таблицы.Добавить("ЛоготипыiOS");
	РезультатРаботы = Новый Структура;
	Для каждого Таблица Из Таблицы Цикл
		Для каждого СтрокаТаблицы Из ЭтаФорма[Таблица] Цикл
			РезультатРаботы.Вставить(СтрокаТаблицы.Идентификатор, СтрокаТаблицы.Значение);
		КонецЦикла;
	КонецЦикла;
	Закрыть(РезультатРаботы);
	
КонецПроцедуры
