//
//
//
//
//
//

//
//
//
//
//
&НаКлиенте
Процедура ДокументПоUID(Команда)
	НайденныйДокументПоUID = ПолучитьДокументПоUIDСтрока(НайденнаяСтрокаUID) 
КонецПроцедуры

&AtServer
Функция ПолучитьДокументПоUIDСтрока(НайденнаяСтрокаUID)
	Возврат Документы.Рейс.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(НайденнаяСтрокаUID)))//.ПолучитьОбъект();
КонецФункции 

&НаКлиенте
Процедура ПолучитьUIDДокумента(Команда)
	
	Если НЕ ДокументРейсЗаказ.Пустая() Тогда 
		НайденнаяСтрокаUID = ПолучитьUIDДокументаСтрока(ДокументРейсЗаказ)
	Иначе 
		Сообщить("Выберите документ из списка!")
	КонецЕсли;

КонецПроцедуры

&AtServer
Функция ПолучитьUIDДокументаСтрока(ДокументРейсЗаказ)
	Возврат Строка(ДокументРейсЗаказ.Ссылка.УникальныйИдентификатор())
КонецФункции 


&НаКлиенте
Процедура ПолучитьКарточкуСотрудникаПОУИД(Команда)
	СправочникСотрудники = ПолучитьКарточкуСотрудникаПоUIDСтрока(ИсходнаяСтрокаСотрудникаУИД) 
КонецПроцедуры

&AtServer
Функция ПолучитьКарточкуСотрудникаПоUIDСтрока(НайденнаяСтрокаUID)
	Возврат Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(НайденнаяСтрокаUID)))
КонецФункции 

