
&НаКлиенте
Процедура ОткрытьФайл(Команда)
	Файл = Новый Файл(ПутьКФайлу);
	Если НЕ Файл.Существует() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден файл!", Объект, "ПутьКФайлу", Истина);
		Возврат;
	КонецЕсли;
	
	Состояние("Загрузка файла...");
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
	ПрочитатьФайл(Адрес);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайл(Адрес)
	ЛистЭкзеля.Очистить();
	
	ВремФайл = ПолучитьИмяВременногоФайла("xlsx");
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ДД.Записать(ВремФайл);
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	//чтение
	Если НЕ ЭтотОбъект.ОткрытьФайл(ВремФайл) Тогда
		Сообщить("Файл " + ПутьКФайлу + " не открыт!");
		УдалитьФайлы(ВремФайл);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ОткрытьЛист(1) Тогда
		Сообщить("Лист 1 не открыт!");
		УдалитьФайлы(ВремФайл);
		Возврат;
	КонецЕсли;
	
	УдалитьФайлы(ВремФайл);
	
	ВывестиТаблицуЗначений(ЭтотОбъект.Лист);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьФайл(Команда)
	ВремФайл = ПолучитьИмяВременногоФайла("xlsx");
	Адрес = СформироватьТестовыйФайл(ВремФайл);
	ДД = ПолучитьИзВременногоХранилища(Адрес);
	ДД.Записать(ВремФайл);
	
	ЗапуститьПриложение(ВремФайл);
КонецПроцедуры

&НаСервере
Функция СформироватьТестовыйФайл(Файл)
	ВремФайл = ПолучитьИмяВременногоФайла("xlsx");
	
	//заполняем ТЗ
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("К1");
	ТЗ.Колонки.Добавить("К2");
	
	Стр = ТЗ.Добавить();
	Стр.К1 = "Номенклатура";
	Стр.К2 = "Количество";
	
	Стр = ТЗ.Добавить();
	Стр.К1 = "Хлеб";
	Стр.К2 = 10;
	
	Стр = ТЗ.Добавить();
	Стр.К1 = "Мясо";
	Стр.К2 = 14;
	
	//сохраняем тз в экзель
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	ЭтотОбъект.Лист = ТЗ;
	ЭтотОбъект.Записать(ВремФайл);
	
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВремФайл));
КонецФункции

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = "c:\";
	Диалог.Фильтр = "Файл Excel 2007 (*.xlsx)|*.xlsx";
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СообщитьПользователю(Знач ТекстСообщенияПользователю,
                               Знач Объект = Неопределено,
                               Знач Поле = "",
                               Отказ = Ложь) Экспорт

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	Сообщение.УстановитьДанные(Объект);
	Сообщение.Сообщить();
	Отказ = Истина;

КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицуЗначений(ТЗ)
	
	Построитель	= Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗ);
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.ВыводитьОбщиеИтоги = Ложь;
	Построитель.ВыводитьПодвалОтчета = Ложь;
	Построитель.ВыводитьПодвалТаблицы = Ложь;
	Построитель.ВыводитьШапкуТаблицы = Ложь;
	Построитель.Вывести(ЛистЭкзеля);
	
	ЛистЭкзеля.Область(1, 2,, ТЗ.Колонки.Количество() + 1).ШиринаКолонки = 15;
	
КонецПроцедуры