
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистраторШагаНомерРейса = 0;
	
	МассивЗначений = Новый Массив;
		Для каждого СтрокаВЦикле Из Метаданные.Документы Цикл
			МассивЗначений.Добавить(СтрокаВЦикле);
		КонецЦикла; 
		
		Итог = МассивЗначений;
		
		
		
		Для каждого СтрокаПлечиМаршрута Из Итог Цикл
			РегистраторШагаНомерРейса = ?((Итог.Количество()-1) = СтрокаПлечиМаршрута[Итог.Количество()-1].	Автонумерация, 1, 0);
					Сообщить(РегистраторШагаНомерРейса);
		КонецЦикла; 
		
КонецПроцедуры
