//
//
//
//
//
//

//
//
//
//
//
&НаКлиенте
Процедура ДокументПоUID(Команда)
	НайденныйДокументПоUID = ПолучитьДокументПоUIDСтрока(НайденнаяСтрокаUID) 
КонецПроцедуры

&AtServer
Функция ПолучитьДокументПоUIDСтрока(НайденнаяСтрокаUID)
	
	//Если ЗначениеЗаполнено(Документы.Рейс.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(НайденнаяСтрокаUID))).Пустая() .Ссылка.Пустая()) Тогда 
	//	Возврат Документы.Рейс.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(НайденнаяСтрокаUID)))
	//ИначеЕсли ЗначениеЗаполнено(Документы.ЗаказРейса.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(НайденнаяСтрокаUID)))) Тогда 
		Возврат Документы.ЗаказРейса.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(НайденнаяСтрокаUID)))
	//КонецЕсли
	
КонецФункции 

&НаКлиенте
Процедура ПолучитьUIDДокумента(Команда)
	
	Если НЕ ДокументРейсЗаказ.Пустая() Тогда 
		НайденнаяСтрокаUID = ПолучитьUIDДокументаСтрока(ДокументРейсЗаказ)
	Иначе 
		Сообщить("Выберите документ из списка!")
	КонецЕсли;

КонецПроцедуры

&AtServer
Функция ПолучитьUIDДокументаСтрока(ДокументРейсЗаказ)
	Возврат Строка(ДокументРейсЗаказ.Ссылка.УникальныйИдентификатор())
КонецФункции 


&НаКлиенте
Процедура ПолучитьКарточкуСотрудникаПОУИД(Команда)
	СправочникСотрудники = ПолучитьКарточкуСотрудникаПоUIDСтрока(ИсходнаяСтрокаСотрудникаУИД) 
КонецПроцедуры

&AtServer
Функция ПолучитьКарточкуСотрудникаПоUIDСтрока(НайденнаяСтрокаUID)
	Возврат Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(Строка(НайденнаяСтрокаUID)))
КонецФункции 

&НаКлиенте
Процедура ПолучитьУИДДока(Команда)
	ПолучитьУИДЗаказКлиента()
КонецПроцедуры

&AtServer
Процедура ПолучитьУИДЗаказКлиента()
	РезультатУИДЗаказКлиента = Строка(ДокументЗаказРейса.Ссылка.УникальныйИдентификатор())
КонецПроцедуры 


&НаКлиенте
Процедура ПолучитьУИДРеквизита(Команда)
	
	 РезультатУИДЗаказКлиента = Строка(ДокументЗаказРейса.Ссылка.УникальныйИдентификатор())

КонецПроцедуры

&AtServer
Процедура ПолучитьУИДЗаказКлиента()
	
	ДокГуид = Документы.ФактическоеЗаполнение.ПолучитьСсылку().УникальныйИдентификатор();
	//ТекСсылка	= Документы.ПродажаРейсовПоВС.ПолучитьСсылку(Строка(ЭтотОбъект.УникальныйИдентификатор));
	//НовыйДок	= Документы.ПродажаРейсовПоВС.СоздатьДокумент();
	//НовыйДок.установитьСсылкуНового(ТекСсылка);
	//НовыйДок.Дата=ТекущаяДата();
	//НовыйДок.ОбменДанными.Загрузка = Истина;
	
	ДокументыФактическоеЗаполнение = Документы.ФактическоеЗаполнение.ПолучитьСсылку(ДокГуид);

	
	
ПолеУИДРеквизита = Строка(ДокументыФактическоеЗаполнение.ОператорАК.Ссылка.УникальныйИдентификатор())
КонецПроцедуры 
