//
//

//
//
//
&НаКлиенте
Процедура ПолучитьМассив(Команда)
	ПолучениеИменнованногоМассива()
КонецПроцедуры

//
//
//
//
&AtServer
Функция ПолучениеИменнованногоМассива()

		МассивДанныхПоСобытиям = Новый Массив;
			СтруктураДанныхПоСобытиям = Новый Структура;
				СтруктураДанныхПоСобытиям.Вставить("aircraft","M-TSLT");
				СтруктураДанныхПоСобытиям.Вставить("current_airport",""); 
				СтруктураДанныхПоСобытиям.Вставить("type","technical_flight"); 
				СтруктураДанныхПоСобытиям.Вставить("start_date","06.07.2019T08:00:00Z"); 
				СтруктураДанныхПоСобытиям.Вставить("end_date","06.07.2019T08:02:00Z"); 	
				СтруктураДанныхПоСобытиям.Вставить("departure_airport","UUDD"); 	
				СтруктураДанныхПоСобытиям.Вставить("arrival_airport","EGPF"); 
				СтруктураДанныхПоСобытиям.Вставить("is_emptyleg",False);
				
				МассивДанныхПоСобытиям.Добавить(СтруктураДанныхПоСобытиям);
				
				
				
				
				
		Возврат МассивДанныхПоСобытиям
			
КонецФункции