
&НаКлиенте
Процедура ПервыйJS(Команда)
	Сформировать()
КонецПроцедуры


Функция ПолучитьИсходныйКодСтраницыПриложенияHTTPСоединение(АдресВебПриложения) 
	
	Соединение = Новый HTTPСоединение(АдресВебПриложения);
	Запрос = Новый HTTPЗапрос("");
    Результат = Соединение.Получить(Запрос);
 
    Возврат Результат.ПолучитьТелоКакСтроку();
	
КонецФункции


Функция ДесериализоватьИзJSON(СтрокаJSON)  
    
    ЧтениеJSON = Новый ЧтениеJSON(); 
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON); 
    ДесериализованныйОбъект = ПрочитатьJSON(ЧтениеJSON); 
    ЧтениеJSON.Закрыть();
    
    Возврат ДесериализованныйОбъект;
    
КонецФункции


Функция СериализоватьВJSONНаСервере(СериализуемыйОбъект) 
    
    ЗаписьJSON = Новый ЗаписьJSON; 
    ЗаписьJSON.УстановитьСтроку();
    НастройкиСериализации = Новый НастройкиСериализацииJSON();
    НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
    ЗаписатьJSON(ЗаписьJSON, СериализуемыйОбъект); 
    // ЗаписатьJSON(ЗаписьJSON, СериализуемыйОбъект, НастройкиСериализации, "ПреобразованиеВJSON", ЭтотОбъект); 
    //
    // ЭтотОбъект недоступнен в безконтекстном вызове, поэтому нужно либо поместить эту функцию в общий модуль, 
    // либо изменить директиву компиляции в &НаСервере
    СтрокаJSON = ЗаписьJSON.Закрыть();
        
    Возврат СтрокаJSON; 

КонецФункции

 // Функция переводит десятичное число в шестнадцатеричное
// Параметры:  _Число                - Число                - Десятичное число
// Возвращаемое значение:  Строка - Шестнадцатеричное число
//
Функция DecToHex(Знач _Число)
	
                База = 16;
                Результат = "";
                Пока _Число <> 0 Цикл
                               Поз =_Число % База;
                               Результат = Сред("0123456789ABCDEF", Поз + 1, 1) + Результат;
                               _Число = Цел(_Число / База);
                КонецЦикла;
                Возврат Результат;
				
КонецФункции // DecToHex()


// Функция переводит шестнадцатеричное число в десятичное
// Параметры: _Hex     - Строка              - Шестнадцатеричное число
// Возвращаемое значение: Число   - Десятичное число
//
Функция HexToDec(Знач _Hex)
                База = 16;
                _Hex = СокрЛП(_Hex);
                СтаршаяСтепень = СтрДлина(_Hex) - 1;
                Результат = 0;
                счСимволов = 1;
                Пока СтаршаяСтепень >=0 Цикл
                               _HexСимвол = Сред(_Hex, счСимволов, 1);
                               Представление = Найти("0123456789ABCDEF", _HexСимвол) - 1;
                               Результат = Результат + Представление * Pow(База, СтаршаяСтепень);
                               СтаршаяСтепень = СтаршаяСтепень - 1;
                               СчСимволов = СчСимволов + 1;
                КонецЦикла;   
                Возврат Результат;
КонецФункции // HexToDec()


Функция ПолучитьИсходныйКодСтраницыПриложения(ВебПриложение) 
	
	АдресВебПриложения = ПолучитьАдресВебПриложения(ВебПриложение);
	Если АдресВебПриложения = Неопределено Тогда
		ВызватьИсключение "Неизвестное веб-приложение: " + ВебПриложение;
	КонецЕсли;
	ИсходныйКодСтраницы = ПолучитьИсходныйКодСтраницыПриложенияHTTPСоединение(АдресВебПриложения);
	ИсходныйКодСтраницы = СтрЗаменить(ИсходныйКодСтраницы, "href=""/static", СтрШаблон("href=""http://%1/static", АдресВебПриложения)); 
	ИсходныйКодСтраницы = СтрЗаменить(ИсходныйКодСтраницы, "src=""/static", СтрШаблон("src=""http://%1/static", АдресВебПриложения));   
	Возврат ИсходныйКодСтраницы;
	
КонецФункции


Функция ПолучитьАдресВебПриложения(ВебПриложение)
	
	Если ВебПриложение = "ТаймлайнСобытий" Тогда
		Возврат "127.0.0.1"
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура Сформировать()
	       ТипДиаграммы  =  "Самолет";	

	Данные = ПолучитьДанныеДляДиаграммы(ТипДиаграммы);
	ОтправитьДанныеВПриложение(Элементы.ПолеHTMLокно, Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДанныеВПриложение(Элемент, Данные) 
	
	ПолучитьОкноПриложения(Элемент)
		.oneSConnector
		.sendDataToApp(СериализоватьВJSON(Данные))
		
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОкноПриложения(Элемент) 
	
	ДокументБраузера = Элемент.Документ;
	ОкноБраузера = ДокументБраузера.parentWindow; // IE
    Если ОкноБраузера = Неопределено Тогда
        ОкноБраузера = ДокументБраузера.defaultView; // Прочие браузеры
	КонецЕсли;
	Возврат ОкноБраузера;
	
КонецФункции


Функция СериализоватьВJSON(СериализуемыйОбъект)    
    Возврат СериализоватьВJSONНаСервере(СериализуемыйОбъект);     
КонецФункции


Функция ПолучитьДанныеДляДиаграммы(Режим)
	
	Группы = Новый Массив;
	События = Новый Массив;
	ДиапазоныПродаж = Новый Массив; 
	
	ВидОбъекта = Справочники.плн_ВидыОбъектов.НайтиПоНаименованию(Режим);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	плн_ОбъектыПроизводства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.плн_ОбъектыПроизводства КАК плн_ОбъектыПроизводства
		|ГДЕ
		|	плн_ОбъектыПроизводства.ВидОбъекта = &ВидОбъекта
		|
		|УПОРЯДОЧИТЬ ПО
		|	плн_ОбъектыПроизводства.Наименование";
	
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипВС="";
		Попытка
			ТипВС=ВыборкаДетальныеЗаписи.Ссылка.ИсточникОбъекта.ТипВС.Наименование;
		Исключение
		КонецПопытки;
		
		
		ИДГруппы=ВыборкаДетальныеЗаписи.Ссылка.Код;
		Группа=Новый Структура("Идентификатор, Заголовок, Текст", 
		ИДГруппы, 
		ВыборкаДетальныеЗаписи.Ссылка.Наименование, 
		ТипВС);
		Группы.Добавить(Группа);
	КонецЦикла;
	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.РольУчастника КАК РольУчастника,
		|	ВложенныйЗапрос.ОбъектПроизводства КАК ОбъектПроизводства,
		|	ВложенныйЗапрос.ВидОбъекта КАК ВидОбъекта,
		|	ВложенныйЗапрос.ИсходноеМесто КАК ИсходноеМесто,
		|	ВложенныйЗапрос.КонечноеМесто КАК КонечноеМесто,
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.ОкончаниеСобытия КАК ОкончаниеСобытия,
		|	ВложенныйЗапрос.Наименование КАК Наименование,
		|	ВложенныйЗапрос.Номер КАК Номер,
		|	ЕСТЬNULL(ВложенныйЗапрос.АэропортВылетаКод, """") КАК АэропортВылетаКод,
		|	ЕСТЬNULL(ВложенныйЗапрос.АэропортВылетаНаименование, """") КАК АэропортВылетаНаименование,
		|	ЕСТЬNULL(ВложенныйЗапрос.АэропортПрилетаКод, """") КАК АэропортПрилетаКод,
		|	ЕСТЬNULL(ВложенныйЗапрос.АэропортПрилетаНаименование, """") КАК АэропортПрилетаНаименование,
		|	ЕСТЬNULL(ВложенныйЗапрос.Сотрудник, """") КАК Сотрудник,
		|	ЕСТЬNULL(ВложенныйЗапрос.Роль, """") КАК Роль,
		|	ВложенныйЗапрос.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ВложенныйЗапрос.ПапкаРейсаНомер, """") КАК ПапкаРейсаНомер,
		|	ЕСТЬNULL(ВложенныйЗапрос.ТипВС, """") КАК ТипВС,
		|	ЕСТЬNULL(ВложенныйЗапрос.НомерРейса, """") КАК НомерРейса,
		|	ЕСТЬNULL(ВложенныйЗапрос.ВС, """") КАК ВС
		|ИЗ
		|	(ВЫБРАТЬ
		|		плн_СобытияУчастники.РольУчастника КАК РольУчастника,
		|		плн_СобытияУчастники.ОбъектПроизводства КАК ОбъектПроизводства,
		|		плн_СобытияУчастники.Ссылка.ВидОбъекта.Наименование КАК ВидОбъекта,
		|		плн_СобытияУчастники.Ссылка.ИсходноеМесто КАК ИсходноеМесто,
		|		плн_СобытияУчастники.Ссылка.КонечноеМесто КАК КонечноеМесто,
		|		плн_СобытияУчастники.Ссылка.Дата КАК Дата,
		|		плн_СобытияУчастники.Ссылка.ОкончаниеСобытия КАК ОкончаниеСобытия,
		|		плн_СобытияУчастники.Ссылка.Наименование КАК Наименование,
		|		плн_СобытияУчастники.Ссылка.Номер КАК Номер,
		|		АэропортВылета.Код КАК АэропортВылетаКод,
		|		АэропортВылета.Наименование КАК АэропортВылетаНаименование,
		|		АэропортПрилета.Код КАК АэропортПрилетаКод,
		|		АэропортПрилета.Наименование КАК АэропортПрилетаНаименование,
		|		РейсЭкипаж.Сотрудник.Наименование КАК Сотрудник,
		|		РейсЭкипаж.Роль.Наименование КАК Роль,
		|		плн_СобытияУчастники.Ссылка КАК Ссылка,
		|		РейсЭкипаж.Ссылка.ПапкаРейса.Номер КАК ПапкаРейсаНомер,
		|		РейсЭкипаж.Ссылка.ВС.ТипВС.Наименование КАК ТипВС,
		|		РейсЭкипаж.Ссылка.НомерРейса КАК НомерРейса,
		|		РейсЭкипаж.Ссылка.ВС.Наименование КАК ВС
		|	ИЗ
		|		Документ.плн_События.Участники КАК плн_СобытияУчастники
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Аэропорты КАК АэропортВылета
		|			ПО плн_СобытияУчастники.Ссылка.ИсходноеМесто.ИсточникОбъекта = АэропортВылета.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Аэропорты КАК АэропортПрилета
		|			ПО плн_СобытияУчастники.Ссылка.КонечноеМесто.ИсточникОбъекта = АэропортПрилета.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВС КАК ВС
		|			ПО плн_СобытияУчастники.ОбъектПроизводства.ИсточникОбъекта = ВС.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Экипаж КАК РейсЭкипаж
		|			ПО плн_СобытияУчастники.Ссылка.ИсточникСобытия = РейсЭкипаж.Ссылка
		|	ГДЕ
		|		плн_СобытияУчастники.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И плн_СобытияУчастники.ОбъектПроизводства.ВидОбъекта = &ВидОбъекта) КАК ВложенныйЗапрос
		|ИТОГИ ПО
		|	ОбъектПроизводства,
		|	Ссылка";
	
	Запрос.УстановитьПараметр("ВидОбъекта", ВидОбъекта);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбъектПроизводства = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	МассивСамолетов=Новый Массив;
	
	
	Пока ВыборкаОбъектПроизводства.Следующий() Цикл
		ИДГруппы=ВыборкаОбъектПроизводства.ОбъектПроизводства.Код;
		ВыборкаСобытие = ВыборкаОбъектПроизводства.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСобытие.Следующий() Цикл


			ВыборкаДетальныеЗаписи = ВыборкаСобытие.Выбрать();
			
			МассивЭкипаж=Новый Массив;
			
			фф=0;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если фф=0 Тогда
					СтруктураРейс=Новый Структура("НомерРейса,
									|ВС,
									|ТипВС,
									|АПВылетКод,
									|АПВылетНаименование,
									|АППрилетКод,
									|АППрилетНаименование,
									|Экипаж",
				                    Строка(ВыборкаДетальныеЗаписи.НомерРейса),
				                    Строка(ВыборкаДетальныеЗаписи.ВС),
				                    Строка(ВыборкаДетальныеЗаписи.ТипВС),
				                    Строка(ВыборкаДетальныеЗаписи.АэропортВылетаКод),
				                    Строка(ВыборкаДетальныеЗаписи.АэропортВылетаНаименование),
				                    Строка(ВыборкаДетальныеЗаписи.АэропортПрилетаКод),
				                    Строка(ВыборкаДетальныеЗаписи.АэропортПрилетаНаименование),
									МассивЭкипаж);
								Событие = Новый Структура("Идентификатор, ИдентификаторГруппы, НомерПапкиРейса, ДатаНачала, ДатаОкончания, ТипСобытия, Текст, Рейс",
											ВыборкаДетальныеЗаписи.Номер,
											ИДГруппы,
											Строка(ВыборкаДетальныеЗаписи.ПапкаРейсаНомер),
											ВыборкаДетальныеЗаписи.Дата,
											ВыборкаДетальныеЗаписи.ОкончаниеСобытия,
											ВыборкаДетальныеЗаписи.ВидОбъекта,
											"", 
											СтруктураРейс);

					фф=1;
				КонецЕсли;
							

				СтруктураЭкипаж=Новый Структура("Роль, ЧленЭкипажа", Строка(ВыборкаДетальныеЗаписи.Роль), Строка(ВыборкаДетальныеЗаписи.Сотрудник));
				МассивЭкипаж.Добавить(СтруктураЭкипаж);
				
			КонецЦикла;
			Если фф=0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураРейс.Экипаж=МассивЭкипаж;
//ВыборкаСобытие.Наименование+" "+ВыборкаСобытие.ИсходноеМесто.Наименование+" "+ВыборкаСобытие.КонечноеМесто.Наименование
			Событие.Рейс=СтруктураРейс;
			ТекстСобытия="";
			Для Каждого эл Из СтруктураРейс Цикл
				ТекстСобытия=ТекстСобытия+Символы.ПС+эл.Ключ+": "+эл.Значение;
			КонецЦикла;
			Событие.Текст=ТекстСобытия;
			События.Добавить(Событие);
		КонецЦикла;	
	КонецЦикла;
	
	
//Коммерчесский модуль
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ПродажаРейсовПоВСДиапазонДоступностиВС.Начало КАК Начало,
		|	ПродажаРейсовПоВСДиапазонДоступностиВС.Окончание КАК Окончание,
		|	ПродажаРейсовПоВСДиапазонДоступностиВС.Ссылка.ВоздушноеСудно.Код КАК ВоздушноеСудноКод
		|ИЗ
		|	Документ.ПродажаРейсовПоВС.ДиапазонДоступностиВС КАК ПродажаРейсовПоВСДиапазонДоступностиВС
		|ГДЕ
		|	НЕ ПродажаРейсовПоВСДиапазонДоступностиВС.Ссылка.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// - Идентификатор - должен быть уникальным, пусть это будет строка "ДиапазонПродаж<ВС><УникальныйИдентификатор>",
			// где <ВС> - код ВС, <УникальныйИдентификатор> - Строка(Новый УникальныйИдентификатор)
			Идентификатор  =  "ДиапазонПродаж" + ВыборкаДетальныеЗаписи.ВоздушноеСудноКод +  Строка(Новый УникальныйИдентификатор);  
			ИДГруппы = ВыборкаДетальныеЗаписи.ВоздушноеСудноКод;
			ДатаНачала = ВыборкаДетальныеЗаписи.Начало;
			ДатаОкончания = ВыборкаДетальныеЗаписи.Окончание;
		Группа = Новый Структура("Идентификатор, ИдентификаторГруппы, ДатаНачала, ДатаОкончания", Идентификатор, ИДГруппы, ДатаНачала, ДатаОкончания);
		ДиапазоныПродаж.Добавить(Группа);
	КонецЦикла;
	
	ДопПараметры = Новый Структура("Цвета", Новый Структура("Рейс, ТО, Неисправность, Positioning, Болезнь, Training, ВПродаже", "#00FF00", "#FFFF00", "#FF0000","#FFFF00", "#FF0000", "#0066CC" ,"#006699"));
	
	// добавление структуры для отбора и отображения на экране пользователя	
	СтруктураПериод = Новый Структура("ДатаНачалаГрафика,ДатаОкончанияГрафика",Период.ДатаНачала, Период.ДатаОкончания);
	
	Данные = Новый Структура("Группы, События, ДиапазоныПродаж, Параметры, СтруктураПериод", Группы, События, ДиапазоныПродаж, ДопПараметры, СтруктураПериод);
	
	Возврат Данные;
		
КонецФункции

