
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресШлюзаAPI											= Константы.АдресШлюзаAPI.Получить();
	ПользовательAPIТаймлайна					= Константы.ПользовательAPIТаймлайна.Получить();
	ПарольAPIТаймлайна								= Константы.ПарольAPIТаймлайна.Получить();
	АдресШлюзаMediaAPI								= Константы.АдресШлюзаMediaAPI.Получить();
	ОтключитьВзаимодействиеСЯдром	= Константы.ОтключитьВзаимодействиеСЯдром.Получить();
	ГлавныйУзел													= Константы.ГлавныйУзел.Получить();
	ИнтервалОбновленияТаймлайна		= Константы.ИнтервалОбновленияТаймлайна.Получить();
	АдресТаймлайна 										= Константы.АдресТаймлайна.Получить();

КонецПроцедуры

&НаКлиенте
Процедура АдресAPIТаймлайнаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	
	Если Модифицированность Тогда 
		НазванияКонстант = "АдресШлюзаAPI, ПользовательAPIТаймлайна, ПарольAPIТаймлайна, АдресAPIТаймлайна, АдресШлюзаMediaAPI, " +
			"ОтключитьВзаимодействиеСЯдром, ГлавныйУзел, ИнтервалОбновленияТаймлайна, АдресТаймлайна";
	    НаборКонстант = Константы.СоздатьНабор(НазванияКонстант);
	    НаборКонстант.Прочитать();
			    // меняем значения констант
						НаборКонстант.АдресШлюзаAPI = АдресШлюзаAPI; 
						НаборКонстант.ПользовательAPIТаймлайна = ПользовательAPIТаймлайна;
						НаборКонстант.ПарольAPIТаймлайна = ПарольAPIТаймлайна; 
						НаборКонстант.АдресAPIТаймлайна = АдресAPIТаймлайна; 
						НаборКонстант.АдресШлюзаMediaAPI = АдресШлюзаMediaAPI; 
						НаборКонстант.ОтключитьВзаимодействиеСЯдром = ОтключитьВзаимодействиеСЯдром;
						НаборКонстант.ГлавныйУзел = ГлавныйУзел;
						НаборКонстант.ИнтервалОбновленияТаймлайна = ИнтервалОбновленияТаймлайна;
						НаборКонстант.АдресТаймлайна = АдресТаймлайна;
			    // записываем набор
			    НаборКонстант.Записать();
			Попытка
				   НаборКонстант.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияНаСервере();
	Модифицированность = Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОбновленияТаймлайнаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресТаймлайнаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВзаимодействиеСЯдромПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГлавныйУзелОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресШлюзаMediaAPIОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АдресШлюзаAPIОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПользовательAPIТаймлайнаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольAPIТаймлайнаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Модифицированность = Истина;
КонецПроцедуры

