



// POST
//HTTPСоединение (HTTPConnection)
//ОтправитьДляОбработки (Post)
//Синтаксис:
//ОтправитьДляОбработки(<HTTPЗапрос>, <ИмяВыходногоФайла>)
//Параметры:
//<HTTPЗапрос> (обязательный)
//Тип: HTTPЗапрос. 
//HTTP-запрос.
//<ИмяВыходногоФайла> (необязательный)
//Тип: Строка. 
//Имя выходного файла, в который записываются полученные с сервера данные.
//Если не указан или содержит пустую строку, то тело ответа может быть получено из объекта HTTPОтвет.
//Возвращаемое значение:
//Тип: HTTPОтвет. 
//Описание:
//Отправляет данные на указанный адрес для обработки при помощи HTTP-запроса POST.
//Доступность:
//Тонкий клиент, мобильный клиент, сервер, толстый клиент, внешнее соединение, мобильное приложение(клиент), мобильное приложение(сервер).
//Пример:
// инициализируем объект для записи XML
Процедура  ПримерHTTPСоединениеОтправитьДляОбработки(HTTPСоединение,Прокси,ПолучитьСертификат,ИмяФайлаЗашифрованногоКонтейнера,ДвДанные,ИмяФайлаСертификата,АдресОтправителя)
	
	ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла();
	ОбъектЗапись = Новый ЗаписьXML;
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("windows-1251", , Ложь);
	ОбъектЗапись.ОткрытьФайл(ИмяФайлаЗапроса, ПараметрыЗаписиXML);
	ОбъектЗапись.ЗаписатьОбъявлениеXML();

		// выводим корневой элемент Request
		ОбъектЗапись.ЗаписатьНачалоЭлемента("Request");

		// выводим элемент ClientInfo
		ОбъектЗапись.ЗаписатьНачалоЭлемента("ClientInfo");
		ОбъектЗапись.ЗаписатьАтрибут("email", АдресОтправителя);
		ОбъектЗапись.ЗаписатьКонецЭлемента();

				Если ИмяФайлаСертификата <> Неопределено Тогда

				    // кодируем в Base64 сертификат
				    ДвДанные.Прочитать(ИмяФайлаСертификата);
				    ФайлСертификатаBase64 = ДвДанные.ПолучитьСтрокуBase64();
				    
				    // выводим элемент Certificate
				    ОбъектЗапись.ЗаписатьНачалоЭлемента("Certificate");
				    ОбъектЗапись.ЗаписатьТекст(ФайлСертификатаBase64);
				    ОбъектЗапись.ЗаписатьКонецЭлемента();
				    
				КонецЕсли;

			Если ИмяФайлаЗашифрованногоКонтейнера <> Неопределено Тогда

			    // кодируем в Base64 зашифрованный контейнер
			    ДвДанные.Прочитать(ИмяФайлаЗашифрованногоКонтейнера);
			    ФайлЗашифрованногоКонтейнераBase64 = ДвДанные.ПолучитьСтрокуBase64();
			    
			    // выводим элемент Data
			    ОбъектЗапись.ЗаписатьНачалоЭлемента("Data");
			    ОбъектЗапись.ЗаписатьТекст(ФайлЗашифрованногоКонтейнераBase64);
			    ОбъектЗапись.ЗаписатьКонецЭлемента();
			    
			КонецЕсли;

		// записываем конец для корневого элемента
		ОбъектЗапись.ЗаписатьКонецЭлемента();
		ОбъектЗапись.Закрыть();

		АдресСервераОнлайнПроверки = "onlinefc.taxcom.ru";
		РесурсНаСервере = "/online_fc/online_fc.dll" + ?(ПолучитьСертификат, "?IncludeCertificate", "");

	// устанавливаем соединение с сервером
	Попытка
	    Соединение = Новый HTTPСоединение(АдресСервераОнлайнПроверки, , , , Прокси);
	Исключение
	    Сообщить("Не удалось установить соединение с сервером онлайн-проверки:" 
	        + Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
	    Возврат;
	КонецПопытки;

	// посылаем запрос
	Попытка
	    HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
	    HTTPЗапрос.УстановитьИмяФайлаТела(ИмяФайлаЗапроса);
	    Результат  = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	    Соединение = Неопределено;
	    Если Результат.КодСостояния > 299 Тогда
	       Сообщить("Код состояния " + Результат.КодСостояния + ". Проверка не выполнена");
	    КонецЕсли;
	Исключение
	    Сообщить(ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
	КонецПопытки;

КонецПроцедуры

// GET
//HTTPСоединение (HTTPConnection)
//Получить (Get)
//Синтаксис:
//Получить(<HTTPЗапрос>, <ИмяВыходногоФайла>)
//Параметры:
//<HTTPЗапрос> (обязательный)
//Тип: HTTPЗапрос. 
//HTTP-запрос.
//<ИмяВыходногоФайла> (необязательный)
//Тип: Строка. 
//Имя файла, в который помещаются данные полученного ресурса. Если не указан или содержит пустую строку, то тело ответа может быть получено из объекта HTTPОтвет.
//Возвращаемое значение:
//Тип: HTTPОтвет. 
//Описание:
//Получает данные с HTTP-сервера, используя GET-запрос.
//Доступность:
//Тонкий клиент, мобильный клиент, сервер, толстый клиент, внешнее соединение, мобильное приложение(клиент), мобильное приложение(сервер).
//Пример:
Процедура ПримерHTTPСоединениеПолучить()
	//
	//
	//
	//
	//
КонецПроцедуры

// Patch
//
//HTTPСоединение (HTTPConnection)
//Изменить (Patch)
//Синтаксис:
//Изменить(<HTTPЗапрос>)
//Параметры:
//<HTTPЗапрос> (обязательный)
//Тип: HTTPЗапрос. 
//Запрос, передаваемый на сервер.
//Возвращаемое значение:
//Тип: HTTPОтвет. 
//Описание:
//Изменяет данные на сервере при помощи PATCH-запроса.
//Передаются только изменения объекта.
//Доступность:
//Тонкий клиент, мобильный клиент, сервер, толстый клиент, внешнее соединение, мобильное приложение(клиент), мобильное приложение(сервер).
//Примечание:
//При использовании мобильной платформы на устройствах под управлением ОС Android версий 2.3 - 4.4 данный метод недоступен, и его вызов приведет к исключению.
//
// Пример:
Процедура HTTPСоединениеPatch()
	//
	//
	//
КонецПроцедуры

