
&НаСервере
Процедура ПроверитьНезакрытыеРейсыНаСервере()
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПапкиРейсов.ПапкаРейса КАК ПапкаРейса,
		|	ПапкиРейсов.Рейс.ВведеныФактическиеДанныеИАС КАК РейсВведеныФактическиеДанныеИАС,
		|	ПапкиРейсов.Рейс.ВведеныФактическиеДанныеЛС КАК РейсВведеныФактическиеДанныеЛС
		|ИЗ
		|	РегистрСведений.ПапкиРейсов КАК ПапкиРейсов
		|ГДЕ
		|	НЕ ПапкиРейсов.ПапкаРейса В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					НезавершенныеПапки.ПапкаРейса КАК ПапкаРейса
		|				ИЗ
		|					РегистрСведений.ПапкиРейсов КАК НезавершенныеПапки
		|				ГДЕ
		|					НезавершенныеПапки.Рейс.ДатаПрилета <= &ТекущаяДата)
		|	И (ПапкиРейсов.Рейс.ВведеныФактическиеДанныеИАС = ЛОЖЬ
		|			ИЛИ ПапкиРейсов.Рейс.ВведеныФактическиеДанныеЛС = ЛОЖЬ)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить(ВыборкаДетальныеЗаписи.ПапкаРейса);
	КонецЦикла;
		

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНезакрытыеРейсы(Команда)
	ПроверитьНезакрытыеРейсыНаСервере();
КонецПроцедуры
