
&НаКлиенте
Процедура ВыполнитьЗапрос(Команда)
	
	
	
	Объект.ТекстЗапроса = "?" + 
	"" + "" +
	"" + "" +
	"" + "" +
	"" + "" +
	"" + "" +
	"" + "" +
	"" + "" ;
	
	
	
	// !!! HTTP-соединение с параметрами по умолчанию
	Соединение = Новый HTTPСоединение(Объект.СерверЗапроса);     
	
	// С помощью диалога выбора файла 
	// настраиваем путь для сохранения
	// скачиваемого файла на диск
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	
	// Если фильтр по расширению указан, то
	// используем его
	Если ЗначениеЗаполнено(Объект.РасширениеВыходногоФайла) Тогда
		Фильтр = НСтр("ru = 'Файл'") + 
		"(*."+Объект.РасширениеВыходногоФайла+")|*."+
		Объект.РасширениеВыходногоФайла;       
		ДиалогОткрытияФайла.Фильтр = Фильтр;
	КонецЕсли;
	ДиалогОткрытияФайла.Заголовок = "Выберите путь и имя файла";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	
	
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		// !!! Выполняем GET-запрос, указав полный путь 
		// к файлу на сервере и путь сохранения загруженного
		// файла
		Соединение.Получить(Объект.ТекстЗапроса, 
		ДиалогОткрытияФайла.ПолноеИмяФайла);      
		Предупреждение("GET-запрос успешно выполнен!");
	Иначе
		Текст = "ru = ""Файл не выбран!""; en = ""File not selected!""";
		Предупреждение(НСтр(Текст));
	КонецЕсли;


КонецПроцедуры
