
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого Представление Из Параметры.СписокПредставлений Цикл
		Строка = Представления.Добавить();
		Строка.КодЯзыка = Представление.КодЯзыка;
		Строка.ПредставлениеЯзыка = Представление.ПредставлениеЯзыка;
		Строка.Представление = Представление.Представление;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)

	РезультатРедактирования = Новый Массив;
	Для каждого Представление Из Представления Цикл
		Параметр = Новый Структура("КодЯзыка, Представление");
		Параметр.КодЯзыка = Представление.КодЯзыка;
		Параметр.Представление = Представление.Представление;
		РезультатРедактирования.Добавить(Параметр);
	КонецЦикла;
	Закрыть(РезультатРедактирования);
	
КонецПроцедуры
