
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолучитьМакетНаСервере()
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетНаСервере() 
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетHMLДокумента");
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры



|<html><head></head>
|<body><base href="v8config://a0dca17a-effe-11e9-ee94-b42e9905bfa2/mdobject/ida2219b08-effe-11e9-ee94-b42e9905bfa2/8eb4fad1-1fa6-403e-970f-2c12dbb43e23">
|<meta content="text/html; charset=utf-8" http-equiv="Content-Type"><link rel="stylesheet" type="text/css" href="v8help://service_book/service_style">
|<meta name="GENERATOR" content="MSHTML 11.00.9600.18098">
|<p>В&nbsp;отдельных случаях, конфигурации
| требуется доступ к сети Интернет,
|  например, для загрузки адресного
|   классификатора с сайта поддержки
|    пользователей 1С:Предприятия
|     фирмы «1С». При использования
|     &nbsp;прокси‑сервера для доступа
|      в сеть Интернет,&nbsp;необходимо
|       <a href="../id4399c19a-ddba-42e9-88b4-c5c28abad237/038b5c85-fb1c-4082-9c4c-e69f8928bf3a">указать его настройки</a>. </p>
|<p><br></p>
|<br><br><br>
|<p>Или вот <a href="../e1cib/list/Документ.Рейс">Рейс</a></p>
|<p>Или <a href="e1c://server/vl/demo#e1cib/list/Документ.Рейс">Папка Рейса</a></p>
|<p>Или вот <a href="e1c://server/vl/demo#e1cib/list/Документ.Рейс">список ВС</a></p>
|</body></html>









