
&НаСервере
Функция ЗаолнитьАПНаСервере()

	Если Не ВС.Ссылка.Пустая() И СписокАП.Количество() > 0 И ЗначениеЗаполнено(ЦеноваяКатегория) Тогда 	
		ДокВС = Документы.ПродажаРейсовПоВС.НайтиПоРеквизиту("ВоздушноеСудно", ВС);

			Если ДокВС.Ссылка.Пустая() Тогда 
				Возврат Ложь;
			КонецЕсли;

		ОбъектДокВС = ДокВС.Ссылка.ПолучитьОбъект();
		ТЧОбслуживаниеВСВАП = ОбъектДокВС.ОбслуживаниеВСВАП;

					Для Каждого СтрокаТЧСписокАП Из СписокАП Цикл 
						Если ПроверкаНаИмеющуюсяЗапись(СтрокаТЧСписокАП.КодАП, ЦеноваяКатегория)  И 
							Не Справочники.Аэропорты.НайтиПоКоду(СтрокаТЧСписокАП.КодАП).Ссылка.Пустая() Тогда 
								НоваяСтрокаТЧ = ТЧОбслуживаниеВСВАП.Добавить();
								НоваяСтрокаТЧ.Аэропорт = Справочники.Аэропорты.НайтиПоКоду(СтрокаТЧСписокАП.КодАП);
								НоваяСтрокаТЧ.Стоимость = ЦеноваяКатегория;
						КонецЕсли;
					КонецЦикла;

				Попытка
					ОбъектДокВС.Записать(РежимЗаписиДокумента.Запись);
					Возврат Истина;				
				Исключение
					 Сообщить(ОписаниеОшибки());
					Возврат Ложь;
				КонецПопытки;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПроверкаНаИмеющуюсяЗапись(СтрокаТЧСписокАП, ЦеноваяКатегория)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Аэропорт", Справочники.Аэропорты.НайтиПоКоду(СтрокаТЧСписокАП));
	Запрос.УстановитьПараметр("Стоимость", ЦеноваяКатегория);
	Запрос.Текст = "ВЫБРАТЬ
		|	ПродажаРейсовПоВСОбслуживаниеВСВАП.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПродажаРейсовПоВС.ОбслуживаниеВСВАП КАК ПродажаРейсовПоВСОбслуживаниеВСВАП
		|ГДЕ
		|	ПродажаРейсовПоВСОбслуживаниеВСВАП.Аэропорт = &Аэропорт
		|	И ПродажаРейсовПоВСОбслуживаниеВСВАП.Стоимость = &Стоимость";
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат Ложь;
		КонецЦикла;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ЗаолнитьАП(Команда)
	Если ЗаолнитьАПНаСервере() Тогда
		ТекстПредупреждения = "Заполнение дынных по справочнику АП в карточке Коммерческих настроек ВС выполнено!";
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияПредупреждение", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, ТекстПредупреждения, 0, 	"Внимание!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияПредупреждение(Параметры) Экспорт
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайлаНачалоВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаНачалоВыбора()

    ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
    ПараметрыДиалога.Заголовок = "НачатьПомещениеФайлаНаСервер";
    ПараметрыДиалога.МножественныйВыбор = Истина;
	ПараметрыДиалога.Фильтр = "Файл формата csv (*.csv)|*.csv";

	ЗавершениеОбратныйВызов = Новый ОписаниеОповещения("ЗавершениеОбратныйВызов", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ЗавершениеОбратныйВызов,,,, ПараметрыДиалога);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбратныйВызов(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	ПутьКФайлуСтрока = ОписаниеПомещенногоФайла.Адрес;
	ПутьКФайлуНачалоВыбора = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАПИзcsv(Команда)

	Если ЭтоАдресВременногоХранилища(ПутьКФайлуСтрока) Тогда
		 ПолученныеДанные = ПолучитьИзВременногоХранилища(ПутьКФайлуСтрока);
	КонецЕсли;

	ПолученныеДанныеСтрока =  ПолучитьСтрокуИзДвоичныхДанных(ПолученныеДанные,  КодировкаТекста.UTF8);

		УдалитьИзВременногоХранилища(ПутьКФайлуСтрока);

	Если 	Не ЗначениеЗаполнено(ПолученныеДанныеСтрока) Тогда 
		Возврат;
	КонецЕсли;

		//очищаем таблицу и удаляем информацию
			СписокАП.Очистить(); 
				ЭтаФорма.Элементы.СписокАП.Обновить(); 

		// чтение
		ЗагружаемыйФайл = Новый ТекстовыйДокумент;
		ЗагружаемыйФайл.ДобавитьСтроку(ПолученныеДанныеСтрока);

			Для НомерСтроки = 1 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
				Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
				Строка = СокрЛП(Строка);
				Строка = СтрЗаменить(Строка, ",", "");
				НовыйСтолбец = СписокАП.Добавить();
				НовыйСтолбец.КодАП = Строка;
    		КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//123
КонецПроцедуры
